{
  "backend/main.mo": "Main Motoko actor defining data types (PDFs, checklists, user profiles), storage maps, and canister endpoints for checklist management, PDF upload, user profiles, Dropbox token management, and access-controlled admin operations.",
  "feature_evidence.json": "Feature evidence report listing three new checklist items to be added: washer drain secured (Yes/No in plumbing), carbon monoxide test (Yes/No in safety), and hot water arrival time (text field in plumbing/water heater), each mapped to affected frontend files.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, noting recent additions of three new checklist fields (carbon monoxide test, hot water arrival time, washer drain secured) across types, defaults, form page, and PDF generation.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell with a root div and module script entry point for the React app, titled 'Digital inspection checklist form with PDF export and shared Dropbox upload'.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with checklist and admin routes, handles actor initialization and loading states, manages profile setup modal, and wraps everything in ThemeProvider and Toaster.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI component displaying an access denied card with a shield icon, descriptive message, and a button to navigate back to the home page.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users to enter their name for first-time profile setup, preventing dismissal until a name is submitted.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Route guard component that checks authentication and admin status, rendering a loading spinner, access denied screen, or the wrapped children accordingly.",
  "frontend/src/components/checklist/ChecklistSection.tsx": "Presentational wrapper component that renders a titled, optionally described checklist section with a separator and consistent spacing around its children.",
  "frontend/src/components/checklist/YesNoField.tsx": "Reusable radio group field component for binary Yes/No checklist questions, accepting a label, current value, and onChange handler.",
  "frontend/src/components/layout/Footer.tsx": "Renders a site footer with copyright year and a 'Built with caffeine.ai' attribution link that includes UTM tracking parameters based on the current hostname.",
  "frontend/src/components/layout/Header.tsx": "Renders the app header with navigation, login/logout via Internet Identity, a theme toggle, and conditional admin controls including a 'Get Admin Access' button and an Admin settings link.",
  "frontend/src/components/layout/ThemeToggle.tsx": "A button component that toggles between light and dark themes using next-themes, avoiding hydration mismatches by only rendering after mount.",
  "frontend/src/components/system/InitErrorScreen.tsx": "Displays a full-screen error card when the application fails to initialize, showing the error message, troubleshooting steps, and an optional retry button.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using TanStack Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and login status state.",
  "frontend/src/hooks/useQueries.ts": "Exports TanStack Query hooks for backend interactions including user profile, user role, admin status, admin privilege claiming, and Dropbox token management.",
  "frontend/src/index.css": "Defines global Tailwind CSS base styles and CSS custom properties for the design system's color tokens in both light and dark themes.",
  "frontend/src/lib/checklist/defaults.ts": "Exports a factory function that returns a default empty ChecklistFormData object with today's date and all fields initialized to their zero/false values.",
  "frontend/src/lib/checklist/types.ts": "Defines the TypeScript interface ChecklistFormData describing the full structure of a safety inspection checklist form across five sections plus notes and work order guidance.",
  "frontend/src/lib/pdf/downloadPdf.ts": "Utility function that triggers a browser download of a PDF file from a Uint8Array by creating a temporary object URL and programmatically clicking an anchor element.",
  "frontend/src/lib/pdf/filename.ts": "Exports a `sanitizeFilename` function that strips invalid characters from a room number string and returns a safe `.pdf` filename.",
  "frontend/src/lib/pdf/generateChecklistPdf.ts": "Generates a simple PDF from `ChecklistFormData` by building a plain-text representation of all checklist sections and encoding it as a `Uint8Array`.",
  "frontend/src/lib/upload/uploadChecklistPdf.ts": "Uploads a PDF `Uint8Array` to Dropbox via the Files Upload API using a provided access token, returning a success/error result object.",
  "frontend/src/main.tsx": "React app entry point that wraps the `App` component with `QueryClientProvider` and `InternetIdentityProvider` before mounting to the DOM.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Admin-only settings page that allows viewing the current Dropbox token status and saving a new Dropbox access token via a form with show/hide toggle.",
  "frontend/src/pages/ChecklistFormPage.tsx": "Main checklist form page that collects inspection data, generates a PDF on submit, triggers a browser download, and optionally uploads the PDF to Dropbox if configured.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with optional sessionStorage persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors using OKLCH variables, border radii, fonts, shadows, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the state of a Home Inspection Checklist app project, including three pending feature requests to add new checklist items to the plumbing/laundry, safety/appliances, and plumbing/water heater sections."
}