{
  "backend/main.mo": "Main backend canister managing PDF storage, user profiles, admin permissions, Dropbox token handling, and secure access control enforcement.",
  "backend/migration.mo": "Defines migration from old actor state to new schema by adding the adminsClaimed field initialized to false.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to relevant frontend files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of key frontend files across the project.",
  "frontend/index.css": "Global Tailwind-based style sheet defining color variables and theming for light and dark modes.",
  "frontend/index.html": "Minimal HTML entry file that mounts the React application and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React application setup with routing, identity handling, actor initialization, profile modal, and error handling.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI component displaying an access‑denied message with navigation back to the home page.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users to enter and save their profile name on first login.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Wrapper component that restricts children to admin users, showing loaders or access‑denied states when applicable.",
  "frontend/src/components/checklist/ChecklistSection.tsx": "Reusable component rendering a titled checklist section with optional description and content area.",
  "frontend/src/components/checklist/YesNoField.tsx": "Renders a labeled yes/no radio field and reports changes to a parent handler.",
  "frontend/src/components/layout/Footer.tsx": "Displays an app footer with year, attribution, and a dynamic caffeine.ai link.",
  "frontend/src/components/layout/Header.tsx": "Provides navigation, login/logout controls, and admin access management in the app header.",
  "frontend/src/components/system/InitErrorScreen.tsx": "Shows an initialization error message with troubleshooting steps and optional retry.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook for managing login state and identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, roles, admin privileges, and Dropbox token operations.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/lib/checklist/defaults.ts": "Generates the default checklist form data structure with initial values.",
  "frontend/src/lib/checklist/types.ts": "Defines TypeScript interfaces for the checklist form data structure.",
  "frontend/src/lib/pdf/downloadPdf.ts": "Creates a PDF blob and triggers a client-side download.",
  "frontend/src/lib/pdf/filename.ts": "Sanitizes a room number into a safe PDF filename.",
  "frontend/src/lib/pdf/generateChecklistPdf.ts": "Builds a text-based PDF from checklist form data and returns it as a Uint8Array, using simple string assembly and a minimal PDF wrapper.",
  "frontend/src/lib/upload/uploadChecklistPdf.ts": "Uploads a generated PDF to Dropbox using fetch and an access token, returning success or error info.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Provides an admin UI for viewing and updating the stored Dropbox token with validation and status feedback.",
  "frontend/src/pages/ChecklistFormPage.tsx": "Renders the full checklist form, generates and downloads a PDF, and optionally uploads it to Dropbox.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, store, and clear URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended colors, typography, animations, and container settings.",
  "project_state.json": "Describes the app’s rebuild goals, highlighting load failures, Dropbox upload issues, and requirements for an admin flow to manage Dropbox tokens. Lists existing features, new requests, and known issues for the Safety Inspection project."
}