{
  "backend/main.mo": "Actor manages user profiles, Dropbox token storage, authorization, and PDF retrieval with access control but no backend PDF upload implementation.",
  "feature_evidence.json": "Feature evidence report mapping features to related source files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend files used in the project.",
  "frontend/index.css": "Global Tailwind-based styling defining light/dark theme tokens and base UI variables.",
  "frontend/index.html": "Base HTML document that mounts the React application and loads main.tsx.",
  "frontend/src/App.tsx": "Main app router and layout setup with profile initialization, theming, and page routing.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI card that displays an access denied message with navigation back to home.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users to enter and save their profile name.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Route guard that checks admin status and shows loading or access denied screens.",
  "frontend/src/components/checklist/ChecklistSection.tsx": "Layout wrapper for checklist form sections with title, description, and content area.",
  "frontend/src/components/checklist/YesNoField.tsx": "Reusable Yes/No radio field component for checklist boolean inputs.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright, branding, and Caffeine.ai link with tracking.",
  "frontend/src/components/layout/Header.tsx": "Header component with navigation, login/logout handling, and admin access button based on authentication and admin status.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context including login, logout, status tracking, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profile, roles, admin status, and Dropbox token using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light/dark themes and global layout settings.",
  "frontend/src/lib/checklist/defaults.ts": "Returns the default structure and initial values for a checklist form.",
  "frontend/src/lib/checklist/types.ts": "Type definitions describing the full structure of the checklist form data.",
  "frontend/src/lib/pdf/downloadPdf.ts": "Creates a blob from PDF bytes and triggers a download in the browser.",
  "frontend/src/lib/pdf/filename.ts": "Sanitizes a room number into a safe PDF filename.",
  "frontend/src/lib/pdf/generateChecklistPdf.ts": "Generates a simple text-based PDF from checklist data using a minimal custom PDF builder.",
  "frontend/src/lib/upload/uploadChecklistPdf.ts": "Uploads a checklist PDF to Dropbox but relies on an unimplemented backend token fetch.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Admin settings page UI for viewing, entering, and saving a Dropbox access token, with status indicators and secure input handling.",
  "frontend/src/pages/ChecklistFormPage.tsx": "Form page that captures checklist data, generates and downloads a PDF, and optionally uploads it to Dropbox using a stored token.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and container settings.",
  "project_state.json": "Project state file describing the app’s goals, implemented features, and pending feature requests."
}