{
  "backend/main.mo": "Motoko backend implementing access‑controlled PDF storage, user profiles, Dropbox token admin management, and sorted PDF retrieval.",
  "feature_evidence.json": "Feature evidence report listing implemented checklist additions, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in the checklist app.",
  "frontend/index.css": "Tailwind base styles defining light/dark OKLCH color tokens and global layout rules.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app with routing, identity checks, profile setup flow, and initialization handling.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI card shown when a user lacks access, with a button to return home.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users for their name and submitting profile setup.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Route guard that checks admin status and displays loading or access‑denied states.",
  "frontend/src/components/checklist/ChecklistSection.tsx": "Layout wrapper for checklist sections with title, description, and content area.",
  "frontend/src/components/checklist/YesNoField.tsx": "Reusable yes/no radio input component for checklist items.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing year, app branding, and a link to caffeine.ai with UTM tracking.",
  "frontend/src/components/layout/Header.tsx": "Provides the app header with navigation, login/logout handling, and admin access controls based on identity and query hooks.",
  "frontend/src/components/system/InitErrorScreen.tsx": "Displays an application initialization error with details and optional retry action.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and logic for Internet Identity authentication, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, roles, admin privileges, and Dropbox token operations using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light/dark themes.",
  "frontend/src/lib/checklist/defaults.ts": "Provides a function that returns default checklist form data values.",
  "frontend/src/lib/checklist/types.ts": "Defines TypeScript interfaces for the structure of checklist form data.",
  "frontend/src/lib/pdf/downloadPdf.ts": "Generates a PDF blob and triggers a browser download for given bytes and filename.",
  "frontend/src/lib/pdf/filename.ts": "Sanitizes a room number into a safe PDF filename.",
  "frontend/src/lib/pdf/generateChecklistPdf.ts": "Builds a simple text-based PDF from checklist form data and returns it as a Uint8Array.",
  "frontend/src/lib/upload/uploadChecklistPdf.ts": "Uploads a generated PDF to Dropbox via the files/upload API using a provided access token.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Provides an admin UI to view, enter, and save a Dropbox access token with validation and status feedback.",
  "frontend/src/pages/ChecklistFormPage.tsx": "Renders the inspection checklist form, generates and downloads a PDF, and optionally uploads it to Dropbox.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning sensitive data from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme customization, plugins, and design tokens for the project.",
  "project_state.json": "Stores project metadata, known issues, and tracked feature requests for the Safety Inspection app."
}