{
  "kind": "build_request",
  "title": "Fix admin access flow and Dropbox token/upload reliability",
  "projectName": "Safety Inspection",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Diagnose and fix the live app failing to load across major browsers by eliminating any runtime errors during initial render (router mount, auth initialization, React Query actor creation) and ensuring the app consistently reaches the Checklist page or a clear error screen instead of a blank/sad-face page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "App doesn't work,  find  out why and fix it.  How hard is that to understand?"
        ]
      },
      "acceptanceCriteria": [
        "Opening the app in Chrome, Firefox, and Safari renders the main layout (Header + Checklist page) without a blank screen.",
        "If authentication/actor initialization fails, the UI shows a readable error state instead of crashing.",
        "No uncaught exceptions are logged during initial app load in the browser console."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an in-app admin access flow initiated by a button so an authenticated user can obtain admin privileges and then access the Admin Settings page to save a Dropbox token.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-11",
          "msg-12"
        ],
        "quotes": [
          "No create a button that gives me admin access so i can add a drop box token",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "When a user is logged in but not an admin, the Header shows a clear call-to-action to obtain admin access.",
        "Completing the admin access flow results in the user being recognized as admin (useIsCallerAdmin returns true) without requiring a manual refresh.",
        "After admin access is granted, the Header shows the existing Admin button and the user can navigate to /admin successfully.",
        "Non-authenticated users cannot obtain admin access and are prompted to log in first."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement backend support for the admin access flow by adding an explicit method to grant admin privileges in a controlled way (e.g., first-admin-claim when no admins exist, or another deterministic rule), and persist the resulting role assignment using the existing authorization system so it remains effective across sessions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "create a button that gives me admin access so i can add a drop box token"
        ]
      },
      "acceptanceCriteria": [
        "A new backend method exists to perform the admin grant/claim and returns a success/failure outcome without trapping for expected failure cases.",
        "The method only grants admin when the controlled rule is satisfied; otherwise it denies the request.",
        "After a successful grant, isCallerAdmin returns true for that principal and remains true on subsequent calls."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix Dropbox upload failures by ensuring the Dropbox token is retrieved and used correctly for uploads, and that error messages shown to users are actionable (distinguish missing token vs. Dropbox API failure).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "why is it failing to upload to dropbox?",
          "I am submitting it on the live app"
        ]
      },
      "acceptanceCriteria": [
        "If no Dropbox token is configured, submitting the checklist downloads the PDF and shows a clear message indicating Dropbox is not configured (no attempted upload).",
        "If a token is configured, submitting the checklist attempts an upload to https://content.dropboxapi.com/2/files/upload and reports success/failure.",
        "On Dropbox API failure, the UI displays a user-readable failure toast and logs the detailed error text for debugging.",
        "No code path calls frontend/src/lib/upload/uploadChecklistPdf.ts in a way that throws 'must be called from component context'."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure the Admin Settings page and token storage work end-to-end: admins can save a Dropbox access token to the backend and later see that it is configured, while non-admins are denied access with the existing AccessDeniedScreen messaging.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "add a drop box token"
        ]
      },
      "acceptanceCriteria": [
        "As an admin, saving a token on /admin calls the backend and persists the token (subsequent loads show 'Dropbox token is configured').",
        "As a non-admin, navigating to /admin shows the access denied UI (no token data is revealed).",
        "The token is never displayed in plaintext by default in the UI (password-masked input remains the default behavior)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for all user-facing UI text and error messages.",
    "Do not introduce third-party authentication; only Internet Identity is supported.",
    "Do not add external databases or off-platform token storage; store the Dropbox token only in the existing backend canister state."
  ],
  "nonGoals": [
    "Implementing server-side (backend) Dropbox uploads (uploads remain frontend-to-Dropbox).",
    "Adding real-time features (WebSockets), push notifications, or email/SMS integrations.",
    "Adding support for non-Dropbox storage providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}