{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Checklist form + PDF: add Main Shut Off Valve Exercised and Toilet tank cracks/leaks item",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add \"Main Shut Off Valve Exercised\" boolean field to checklist data, render checkbox in the form near the existing main shut-off valve item, and include it in the generated PDF.",
      "acceptanceCriteria": [
        "The checklist TypeScript type (frontend/src/lib/checklist/types.ts) includes a new boolean field for \"Main Shut Off Valve Exercised\" (placed in the appropriate section with the existing main shut-off valve item).",
        "Default checklist data (frontend/src/lib/checklist/defaults.ts) initializes the new field to false.",
        "Checklist form UI (frontend/src/pages/ChecklistFormPage.tsx) renders a checkbox with the label exactly: \"Main Shut Off Valve Exercised\" and updates the form state when toggled.",
        "Generated PDF content (frontend/src/lib/pdf/generateChecklistPdf.ts) includes a corresponding line with an [X]/[ ] marker reflecting the user’s selection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/checklist/types.ts",
          "operation": "modify",
          "description": "Extend the ChecklistFormData type to include a new boolean field for \"Main Shut Off Valve Exercised\" within the same section as the existing main shut-off valve item (section4)."
        },
        {
          "path": "frontend/src/lib/checklist/defaults.ts",
          "operation": "modify",
          "description": "Initialize the new \"Main Shut Off Valve Exercised\" boolean field to false in getDefaultChecklistData(), keeping it grouped with the existing section4 main shut-off valve defaults."
        },
        {
          "path": "frontend/src/pages/ChecklistFormPage.tsx",
          "operation": "modify",
          "description": "Render a new checkbox with label exactly \"Main Shut Off Valve Exercised\" near the existing main shut-off valve checkbox and wire onCheckedChange to update the new section4 field in form state."
        },
        {
          "path": "frontend/src/lib/pdf/generateChecklistPdf.ts",
          "operation": "modify",
          "description": "Update PDF content generation to include a new line item for \"Main Shut Off Valve Exercised\" using the existing checkbox marker style ([X]/[ ]) and reflecting the new boolean field value."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add \"Toilet tank is free of cracks/leaks\" yes/no field under the Toilet subsection, render it using the existing YesNoField UI, and include its value in the generated PDF output.",
      "acceptanceCriteria": [
        "The checklist TypeScript type (frontend/src/lib/checklist/types.ts) includes a new field for \"Toilet tank is free of cracks/leaks\" under the existing toilet subsection, using the same value style as other yes/no fields (\"yes\" | \"no\" | \"\").",
        "Default checklist data (frontend/src/lib/checklist/defaults.ts) initializes the new toilet tank field to an empty string.",
        "Checklist form UI (frontend/src/pages/ChecklistFormPage.tsx) renders the new question in the toilet area using the existing YesNoField component with the label exactly: \"Toilet tank is free of cracks/leaks\".",
        "Generated PDF content (frontend/src/lib/pdf/generateChecklistPdf.ts) includes a line for this new toilet tank item and prints the selected value (yes/no) or N/A when unset."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/checklist/types.ts",
          "operation": "modify",
          "description": "Add a new \"yes\" | \"no\" | \"\" field for \"Toilet tank is free of cracks/leaks\" under the existing toilet-related subsection (within section3 near the existing toiletFlushTest fields) to match the app’s existing yes/no value style."
        },
        {
          "path": "frontend/src/lib/checklist/defaults.ts",
          "operation": "modify",
          "description": "Initialize the new toilet tank yes/no field to an empty string in getDefaultChecklistData() under the same toilet-related subsection where the type was added."
        },
        {
          "path": "frontend/src/pages/ChecklistFormPage.tsx",
          "operation": "modify",
          "description": "In the Toilet area (near the existing Toilet Flush Test questions), render the new question using the existing YesNoField component with label exactly \"Toilet tank is free of cracks/leaks\", and wire its onChange to update the new field in form state."
        },
        {
          "path": "frontend/src/lib/pdf/generateChecklistPdf.ts",
          "operation": "modify",
          "description": "Add PDF output for the new toilet tank item, printing the selected value (yes/no) and showing N/A when the field is unset (empty string), consistent with other yes/no PDF lines."
        }
      ]
    }
  ]
}